package Lesson2;

public class Main {

    //Напишите программу, которая находит числовые дупликаты в массиве
    /*
    Пример:
    5 2 7 7 5
    Вывод:
    Дупликат: 5
    Дупликат: 7
     Посчитайте временную сложность вашего алгоритма
     */

    //Напишите программу, которая находит строковые дупликаты в массиве
    /*
    Пример:
    "bcd", "abd", "jude", "bcd"
    Вывод:
    Дупликат: bcd
     Посчитайте временную сложность вашего алгоритма
     */




    //Напишите программу, которая находит второй минимальный элемент в массиве
    /*
    Пример:
1, 4, 0, 2, 7, 3
    Вывод:
    Второй мин элемент: 1
     Посчитайте временную сложность вашего алгоритма
     */
}
