package TasksSolutions;

public class Tasks {
    // 1 Задание
    /*
    Сложите все элементы массива между собой
    [1,2,3,4]
    Результат: 10
     */

    // 2 Задание
    /*
    Напишите программу, которая высчитывает среднее арифметическое всех элементов в массиве
        [1,2,3,4]
        Результат :(1+2+3+4)/4 = 2.5
     */

    // 3 Задание
    /*
    Напишите программу, которая вставляет элемент в определенную позицию в массиве

    До вставки:
    [25,14,56,15,47]
    После вставки:
    [25,14,5,56,15]
     */

    // 4 Задание
    /*
    Напишите программу, которая находит максимальный и минимальный элемент в массиве
     */

    /*
     Пример: Рассмотрим пример, чтобы сложить три числа и вывести сумму.
    Шаг 1: Выполнение предварительных условий
    Шаг 2: Разработка алгоритма
    Алгоритм сложения 3 чисел и вывода их суммы:
    НАЧАЛО
    Объявите 3 целочисленные переменные num1, num2 и num3.
    Возьмите три добавляемых числа в качестве входных данных для переменных num1, num2 и num3 соответственно.
    Объявите целочисленную переменную sum для хранения результирующей суммы трех чисел.
    Добавьте 3 числа и сохраните результат в переменной sum.
    Вывести значение переменной sum
    КОНЕЦ
     */
}
